// number, string, boolean, null, undefined

/* -------------------------------------------------------------------------- */
/*                                 number type                                */
/* -------------------------------------------------------------------------- */

let num1:number = 10;
let num2:number = NaN;
let num3:number = -123;
let num4:number = 0.12321;

/* -------------------------------------------------------------------------- */
/*                                 string type                                */
/* -------------------------------------------------------------------------- */

let str1:string = 'hi'
let str2:string = "hi"
let str3:string = `hi ${num2}`

// str3 에 string 값이 아닌 다른 값을 넣게 되면 어떻게 될까?
str3 = 123
// 에러발생
// str3 의 값은 string 이어야만 한다.

/* -------------------------------------------------------------------------- */
/*                                boolean type                                */
/* -------------------------------------------------------------------------- */

let bool1:boolean = true;
let bool2:boolean = false;

/* -------------------------------------------------------------------------- */
/*                              null, undefined                               */
/* -------------------------------------------------------------------------- */

let nullA:null = null;
let undef:undefined = undefined;

/* -------------------------------------------------------------------------- */
/*                                literal type                                */
/* -------------------------------------------------------------------------- */

// 내가 원하는 값만 내보낼 수 있다.
// never 와 다름
// const 와 비슷하다고 볼 수 있음

let numA:number = 10; 
numA = 123123
// 에러가 나지 않음.

// 하지만 literal type 으로 쓰면 어떻게 될까?
let numB:10 = 10;
numB = 123123

let strA:'hi' = 'hi'
let boolA:true = true
