/* -------------------------------------------------------------------------- */
/*                                  any type                                  */
/* -------------------------------------------------------------------------- */

// 그 어떠한 타입도 허용해줌

let obj:any = {x:10};

obj = 123;
obj = () => {}
obj.toUpperCase();

// tsx src/6.any.ts

// 모든 타입을 다 포괄하지만 그만큼 위험하다. 에러에 너무 관대함. 차라리 자바스크립트를 쓰지.

/* -------------------------------------------------------------------------- */
/*                                unknown type                                */
/* -------------------------------------------------------------------------- */

let arr: unknown;

arr = 1;
arr = 'hi'

// any 보다 훨씬 괜찮음

// 에러를 발생시킴
arr.toFixed();

// 타입 좁히기 (정제) narrowing, 자세한 코드는 9.narrowing 을 참고.
if(typeof arr === 'number'){
  arr.toFixed()
}
